add agentic courses
